temp/request.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Webshopv1-IWebshopv1">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:webshop soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <sValue xsi:type="xsd:string"><![CDATA[<?xml version="1.0" encoding="UTF-8"?>

                <REQUEST_TO_WINPRO>
                    <REQUEST_TYPE>0</REQUEST_TYPE>
                    <LIBRARY>WEB_ELEG_COUL1</LIBRARY>
                    <ITEM>VICT310</ITEM>
                    <IMAGE type="svg" view="reverse" />
                    <DIMENSION_LINES>0</DIMENSION_LINES>
                    <CONFIGS>
                        <CONFIG>
                            <WIDTH>4000</WIDTH>
                            <HEIGHT>1400</HEIGHT>
                            
                            <COLOUR>7016STRU</COLOUR>
                            
                            
                            <SASH id="1" leaves="2" leaf_orientation="H" door="0" fixe="0" doorfixe="0">

                    <ASYMETRIC_LEAVES_0>0</ASYMETRIC_LEAVES_0>

                    <FITTING_OPTION code="QQ_serrure" value="QQ_serrure_PR" />

                    <FITTING_OPTION code="QQ_poignee" value="QQ_Poignee_BeqInox" />

                    
                    <SASH_OPTION code="QQ_ferrage" value="QQ_ferrage_A" />

                    <DIRECTION>0</DIRECTION>

                    <FILLING leaf_id="1" filling_id="2">

                                <FILLING_INNER_COLOUR info="">1015STRU</FILLING_INNER_COLOUR>
                                <FILLING_OPTION code="QR_ModTole" value="QR_ModTole_TrouRond"/>
                    </FILLING>

                    </SASH>


                                                
                            
                            <OPTION code="QD_ControleCoheL" value="QD_ControleCoheL_non" />
                            <OPTION code="QD_typepose" value="QD_typepose_RGarrp" />
                            <OPTION code="QD_sensouv" value="QO_sensouv_droiteP" />
                            <OPTION code="QD_poteauG" value="QD_poteauD_Sans" />
                            <OPTION code="QD_poteauD" value="QD_poteauG_Sans" />
                        </CONFIG>
                    </CONFIGS>
                    <GET_CONFIG type="1"/>
                </REQUEST_TO_WINPRO>

                ]]></sValue>
            <sLogin xsi:type="xsd:string">LOGIN</sLogin>
            <sToken xsi:type="xsd:string">TOKEN</sToken>
        </urn:webshop>
    </soapenv:Body>
</soapenv:Envelope>